# IFC_DMSetPSetFldEmpt

## Description
Sets specified Field for IfcEntry's PSet Empty.

```pascal
FUNCTION IFC_DMSetPSetFldEmpt(
				strObjectName : STRING;
				strEntryName  : STRING;
				strPSetName   : STRING;
				strFieldName  : STRING;
				bEmpty        : BOOLEAN) : BOOLEAN;
```

```python

def vs.IFC_DMSetPSetFldEmpt(strObjectName, strEntryName, strPSetName, strFieldName, bEmpty):
    return BOOLEAN
```

## Parameters
|Name|Type|Description|
|---|---|---|
|strObjectName|STRING||
|strEntryName|STRING||
|strPSetName|STRING||
|strFieldName|STRING||
|bEmpty|BOOLEAN||

## Version
Availability: from Vectorworks 2021
## Category
* IFC